
## Plan Result (terraform/aws/openclaw)

[CI link](https://github.com/boxp/arch/actions/runs/22031423688)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_ssm_parameter.grafana_api_key


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ssm_parameter.grafana_api_key will be created
  + resource "aws_ssm_parameter" "grafana_api_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Grafana API Key for OpenClaw metrics context"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/lolice/openclaw/GRAFANA_API_KEY"
      + region         = "ap-northeast-1"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":6924,"Program":"tfcmt","SHA1":"cb39f1033400f3c27f33d175d397c71de34c345e","Target":"terraform/aws/openclaw","Vars":{},"WorkflowName":"pull_request_target"} -->